# Pandas - Data Cleaning

1. Renaming Columns
2. Re-arranging Column Order
3. Checking data types of specific columns
4. Removing Text from column
5. Deaing with Missing Data
6. Replacing Text within a column
7. String operations of column data
8. Removing Columns
9. Dropping Rows

In [1]:
pip install pandas

Requirement already satisfied: pandas in /Users/siewweiheng/miniconda3/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /Users/siewweiheng/miniconda3/lib/python3.12/site-packages (from pandas) (2.1.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/siewweiheng/miniconda3/lib/python3.12/site-packages (from pandas) (2.9.0)
Requirement already satisfied: pytz>=2020.1 in /Users/siewweiheng/miniconda3/lib/python3.12/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/siewweiheng/miniconda3/lib/python3.12/site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in /Users/siewweiheng/miniconda3/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [29]:
# Let's load a new dataset on the number of fires in the Amazon rainforest 

import pandas as pd

file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")

df.tail()

       ano       mes     estado numero  encontro
6449  2012  Dezembro  Tocantins    128  1/1/2012
6450  2013  Dezembro  Tocantins     85  1/1/2013
6451  2014  Dezembro  Tocantins    223  1/1/2014
6452  2015  Dezembro  Tocantins    373  1/1/2015
6453  2016  Dezembro  Tocantins    119  1/1/2016

In [32]:
# How many regions are in the dataset? Hints: Use unique
df["estado"].unique()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

# Renaming Columns

In [33]:
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}

df.rename(columns = new_columns, inplace=True)

In [34]:
# print out the first 5 rows of df. Hints: use head.
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [35]:
# How many years of data do we have? # Hints: Unique
df["year"].unique()

array([1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017])

In [36]:
# Let's explore our datetypes, what are the avaialabe data types. Hints: use info.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6454 non-null   int64
 1   month            6454 non-null   object
 2   state            6454 non-null   object
 3   number_of_fires  6322 non-null   object
 4   date             6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

# Re-arranging columns

In [37]:
# Columns are numbered from 0, left to right
# Let's put date first, month second and year 3rd folloed by state abd number_of_fires
df_rearranged = df[["date", "month", "year", "state", "number_of_fires"]]

# print of the first 5 rows
df_rearranged.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre         0 Fires
1  1/1/1999  Janeiro  1999  Acre         0 Fires
2  1/1/2000  Janeiro  2000  Acre         0 Fires
3  1/1/2001  Janeiro  2001  Acre         0 Fires
4  1/1/2002  Janeiro  2002  Acre         0 Fires

In [38]:
# print the last 5 rows
df_rearranged.tail()

          date     month  year      state number_of_fires
6449  1/1/2012  Dezembro  2012  Tocantins             128
6450  1/1/2013  Dezembro  2013  Tocantins              85
6451  1/1/2014  Dezembro  2014  Tocantins             223
6452  1/1/2015  Dezembro  2015  Tocantins             373
6453  1/1/2016  Dezembro  2016  Tocantins             119

# Determing if a column contains numeric data

In [39]:
# It isn't, let's find our why

df['number_of_fires'].str.isnumeric()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: object

In [40]:
df[df['number_of_fires'].str.isdigit()]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [41]:
# We get the above error because our isdigit() returns Nan for blank or missing values
# To fix this we need to convert our column datatype from non-null objects to a String

df['number_of_fires'].astype(str).str.isdigit()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: bool


- Bascially, `str.isdigit` only returns True for strings containing solely the digits 0-9. 
- By contrast, `str.isnumeric` returns True if it contains any numeric characters. e.g. '½'

# Removing unnecessary text from columns

In [16]:
df['number_of_fires'].str.strip(" Fires")

0         0
1         0
2         0
3         0
4         0
       ...
6449    128
6450     85
6451    223
6452    373
6453    119
Name: number_of_fires, Length: 6454, dtype: object

Strip - Return a copy of the string with leading and trailing characters removed. If chars is omitted or None, whitespace characters are removed. If given and not None, chars must be a string; the characters in the string will be stripped from the both ends of the string this method is called on.

In [42]:
# To replace column with cleaned column

df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6454 non-null   int64
 1   month            6454 non-null   object
 2   state            6454 non-null   object
 3   number_of_fires  6322 non-null   object
 4   date             6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [46]:
df["number_of_fires"].unique()

array(['0', '10', '12', ..., '2.032', '833', '623'], dtype=object)

In [47]:
# We need to convert our number_of_fires column to a float data type
# Also, here's an alternative string manipulation technique we can use

df["number_of_fires"] = df["number_of_fires"].str.replace('','0').astype(float)
df.head()

   year    month state  number_of_fires      date
0  1998  Janeiro  Acre              0.0  1/1/1998
1  1999  Janeiro  Acre              0.0  1/1/1999
2  2000  Janeiro  Acre              0.0  1/1/2000
3  2001  Janeiro  Acre              0.0  1/1/2001
4  2002  Janeiro  Acre              0.0  1/1/2002

#### That was one way we could have handled blank data

# Handling missing data

In [48]:
# Let's reload our dataframe
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
# Creating a true copy of our dataframe
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [49]:
# Viewing the sum of missing values in each column

df.isnull().sum()

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

In [50]:
# We can easily remove Null or NaN (not a number) values 

# Drop rows with NaN values
df = df.dropna() 
df = df.reset_index() # reset's row indexes in case any rows were dropped
df.head()

   index  year    month state number_of_fires      date
0      0  1998  Janeiro  Acre               0  1/1/1998
1      1  1999  Janeiro  Acre               0  1/1/1999
2      2  2000  Janeiro  Acre               0  1/1/2000
3      3  2001  Janeiro  Acre               0  1/1/2001
4      4  2002  Janeiro  Acre               0  1/1/2002

In [51]:
# Let's check and see it worked

df.isnull().sum()

index              0
year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

In [133]:
# Alright so it worked, now let's reload the data and look at a few other methods of dealing with NaN or Null values

# Let's reload our dataframe
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [92]:
# Create a boolean index for all null values

df['number_of_fires'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
6449    False
6450    False
6451    False
6452    False
6453    False
Name: number_of_fires, Length: 6454, dtype: bool

In [93]:
# since df['number_of_fires'].isnull() returns a Series of true/false, we can use the series
# to select the rows of the df.
df[df['number_of_fires'].isnull()].head(10)

     year     month    state number_of_fires      date
68   2006     Abril     Acre             NaN  1/1/2006
110  2008     Junho     Acre             NaN  1/1/2008
127  2005     Julho     Acre             NaN  1/1/2005
206  2004  Novembro     Acre             NaN  1/1/2004
217  2015  Novembro     Acre             NaN  1/1/2015
444  2002  Novembro  alagoas             NaN  1/1/2002
522  2001     Março    Amapa             NaN  1/1/2001
550  2009     Abril    Amapa             NaN  1/1/2009
614  2013     Julho    Amapa             NaN  1/1/2013
642  2001  Setembro    Amapa             NaN  1/1/2001

# What do to with missing data?

* Remove them via .dropna(axis=0)
* Replace them with some arbitary number (e.g. an average)
* Replace them zeros, or Forward Fill (ffill) or Back Fill (backfill)

In [134]:
# Using fillna with zeros

df['number_of_fires'].fillna(0).head()

0    0
1    0
2    0
3    0
4    0
Name: number_of_fires, dtype: object

In [135]:
# Let's try back filling
# back fill is to take the next row's value
# forward fill is to take the prev
df['number_of_fires'].fillna(method='backfill').head(70)

/var/folders/jc/mky5brlx03z7bnn4kgbmdqhm0000gp/T/ipykernel_69861/3271910983.py:4: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['number_of_fires'].fillna(method='backfill').head(70)

0     0
1     0
2     0
3     0
4     0
     ..
65    1
66    2
67    1
68    0
69    0
Name: number_of_fires, Length: 70, dtype: object

In [136]:
df = df['number_of_fires'].fillna(method='backfill')

/var/folders/jc/mky5brlx03z7bnn4kgbmdqhm0000gp/T/ipykernel_69861/2537388672.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df = df['number_of_fires'].fillna(method='backfill')

In [137]:
# View index 444 to see how it changes
# Homework, change 444 using ffill and backfill to see how it changes
df.iloc[444]

'17'

In [138]:
df.iloc[445]

'17'

In [130]:
df.iloc[443]

'22'

In [108]:
# let's make the assumption that blank values are 0 fires

# let's get back our copy of our original pre-processed datafrmae
df = df_copy

# replace all missing or NaN values with 0
df['number_of_fires'] = df['number_of_fires'].fillna(0)

In [78]:
# Let's check to see if we did change our Nans to 0s
df.iloc[444]

year                   2002
month              Novembro
state               alagoas
number_of_fires           0
date               1/1/2002
Name: 444, dtype: object

# Replacing text in columns

In [109]:
df['month'].unique()

array(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

In [110]:
# Let's convert our Portuguese month names to English

month_translations = {'Janeiro': 'January',
'Fevereiro': 'February',
'Março': 'March',
'Abril': 'April',
'Maio': 'May',
'Junho': 'June',
'Julho': 'July',
'Agosto': 'August',
'Setembro': 'September',
'Outubro': 'October',
'Novembro': 'November',
'Dezembro': 'December'}

df["month"] = df["month"].map(month_translations)
df.head()

   year    month state number_of_fires      date
0  1998  January  Acre               0  1/1/1998
1  1999  January  Acre               0  1/1/1999
2  2000  January  Acre               0  1/1/2000
3  2001  January  Acre               0  1/1/2001
4  2002  January  Acre               0  1/1/2002

In [111]:
df.isnull().sum()

year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

# Further string functions on columns

In [112]:
df['state'].unique()
# some states are not capitalized

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [113]:
df['state'] = df['state'].str.title()
df['state'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'Pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'Rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

# Removing columns

In [114]:
df.head()

   year    month state number_of_fires      date
0  1998  January  Acre               0  1/1/1998
1  1999  January  Acre               0  1/1/1999
2  2000  January  Acre               0  1/1/2000
3  2001  January  Acre               0  1/1/2001
4  2002  January  Acre               0  1/1/2002

In [116]:
# Dropping column date
df = df.drop(axis=1, columns=["date"])


# print the first 5 rows
df.head()

   year    month state number_of_fires
0  1998  January  Acre               0
1  1999  January  Acre               0
2  2000  January  Acre               0
3  2001  January  Acre               0
4  2002  January  Acre               0

In [139]:
# Let's reload the data

# Let's reload our dataframe
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}

# rename can only be used for column title
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [140]:
# Drop multiple columns 
df = df.drop(["year", "date"], axis=1)
df.head()

     month state number_of_fires
0  Janeiro  Acre               0
1  Janeiro  Acre               0
2  Janeiro  Acre               0
3  Janeiro  Acre               0
4  Janeiro  Acre               0

# Dropping Rows

Using the df.index function

In [142]:
# Let's drop the first row and reset the index
df = df.drop(df.index[0])
df = df.reset_index()

# print the first 5 rows
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
1      2  Janeiro  Acre               0
2      3  Janeiro  Acre               0
3      4  Janeiro  Acre               0
4      5  Janeiro  Acre              10

In [143]:
# Drop rows 2 and 3
df = df.drop(df.index[[2,3]])


# print the first 5 rows
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
1      2  Janeiro  Acre               0
4      5  Janeiro  Acre              10
5      6  Janeiro  Acre               0
6      7  Janeiro  Acre              12

In [144]:
# Drop a range of rows- Eg, Drop rows 1-4
df = df.drop(df.index[1:4])

#print the first 5 rows
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
6      7  Janeiro  Acre              12
7      8  Janeiro  Acre               4
8      9  Janeiro  Acre               0
9     10  Janeiro  Acre               0